//====================================================================
//文件名称：main.c（应用工程主函数）
//框架提供：SD-Arm（sumcu.suda.edu.cn）
//版本更新：20170801-20200502
//功能描述：见本工程的<01_Doc>文件夹下Readme.txt文件
//====================================================================

#define GLOBLE_VAR
#include "includes.h"      //包含总头文件

//----------------------------------------------------------------------
//声明使用到的内部函数
//main.c使用的内部函数声明处

//----------------------------------------------------------------------
//主函数，一般情况下可以认为程序从此开始运行（实际上有启动过程见书稿）
int main(void)
{
    //（1）======启动部分（开头）==========================================
    //（1.1）声明main函数使用的局部变量
    uint32_t mMainLoopCount;  //主循环使用的记录主循环次数变量
    uint8_t  mFlag;           //主循环使用的临时变量

    //（1.2）【不变】关总中断
    DISABLE_INTERRUPTS;

  
    //（1.3）给主函数使用的局部变量赋初值
    mMainLoopCount = 0;     //主循环使用的记录主循环次数变量
    mFlag = 'A';              //主循环使用的临时变量：蓝灯状态标志
  //  mReference = 2500;
  //  mLightFlag = 1;

    //（1.4）给全局变量赋初值

    //（1.5）用户外设模块初始化
    uart_init(UART_User, 9600);
    dac_init(DAC_VDDA);

    //（1.6）使能模块中断
    uart_enable_re_int(UART_User);

    //（1.7）【不变】开总中断
    ENABLE_INTERRUPTS;

    printf("------------------------------------------------------\n");
    printf("金葫芦提示：DAC呼吸灯实例  \n");
    printf("请将一个LED灯的正极接在 PTE30号引脚，对应于GEC的4号引脚\n");
    printf("另一个引脚接地，就可以看到呼吸灯效果。\n");
    printf("------------------------------------------------------\n");

	//外接小灯，一个接4号口，一个接地

    for (;;)     //for(;;)（开头）
    {
		//值的变化范围	[2900,4000]
         dac_convert(mReference);


    }    
}




