//====================================================================
//文件名称：main.c（应用工程主函数）
//框架提供：SD-Arm（sumcu.suda.edu.cn）
//版本更新：20170801-20200502
//功能描述：见本工程的<01_Doc>文件夹下Readme.txt文件
//====================================================================

#define GLOBLE_VAR
#include "includes.h"      //包含总头文件

//----------------------------------------------------------------------
//声明使用到的内部函数
//main.c使用的内部函数声明处

//----------------------------------------------------------------------
//主函数，一般情况下可以认为程序从此开始运行（实际上有启动过程见书稿）
int main(void)
{
    //（1）======启动部分（开头）==========================================
    //（1.1）声明main函数使用的局部变量
    uint32_t mMainLoopCount;  //主循环使用的记录主循环次数变量
    uint8_t  mFlag;            //主循环使用的临时变量
    
    //（1.2）【不变】关总中断
    DISABLE_INTERRUPTS;
    wdog_stop();

    

    mMainLoopCount = 0;     
    mFlag='A';             
    
    
    
    
    gpio_init(PTC_NUM|(1),1,0);    //初始化蓝灯
	gpio_init(PTC_NUM|(0),0,0);
	gpio_enable_int(PTC_NUM|(0),RISING_EDGE);
//	gpio_enable_int(PTC_NUM|(0),FALLING_EDGE);


    ENABLE_INTERRUPTS;
    cnt=0;ccnt=0;
    printf("------------------------------------------------------\n");   
    printf("金葫芦提示：构件法输出控制小灯亮暗   \n");
    printf("第一次用构件方法点亮的蓝色发光二极管，\n");
    printf("这是进行应用编程的第一步，可以在此基础上，\n");
    printf("“照葫芦画瓢”地继续学习实践。\n");
    printf("例如：改为绿灯；调整闪烁频率等。\n");
    printf("------------------------------------------------------\n"); 
    
    
    for(;;)     //for(;;)（开头）
    {
        

        mMainLoopCount++;                         
        if (mMainLoopCount<=6556677)  continue;   
        mMainLoopCount=0;  
        printf("----\n");
		ccnt=0;
    }    
}